RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_eth_v2.h
#define ETH_PCS_AN_LP_BASE_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.PCS_AN_EXP */
#define ETH_PCS_AN_EXP_REMOVED_31_0_Pos         0UL
#define ETH_PCS_AN_EXP_REMOVED_31_0_Msk         0xFFFFFFFFUL
/* ETH.PCS_AN_NP_TX */
#define ETH_PCS_AN_NP_TX_REMOVED_31_0_Pos       0UL
#define ETH_PCS_AN_NP_TX_REMOVED_31_0_Msk       0xFFFFFFFFUL
/* ETH.PCS_AN_LP_NP */
#define ETH_PCS_AN_LP_NP_REMOVED_31_0_Pos       0UL
#define ETH_PCS_AN_LP_NP_REMOVED_31_0_Msk       0xFFFFFFFFUL
/* ETH.PCS_AN_EXT_STATUS */
#define ETH_PCS_AN_EXT_STATUS_REMOVED_31_0_Pos  0UL
#define ETH_PCS_AN_EXT_STATUS_REMOVED_31_0_Msk  0xFFFFFFFFUL
/* ETH.TX_PAUSE_QUANTUM1 */
#define ETH_TX_PAUSE_QUANTUM1_QUANTUM_P2_Pos    0UL
#define ETH_TX_PAUSE_QUANTUM1_QUANTUM_P2_Msk    0xFFFFUL
#define ETH_TX_PAUSE_QUANTUM1_QUANTUM_P3_Pos    16UL
#define ETH_TX_PAUSE_QUANTUM1_QUANTUM_P3_Msk    0xFFFF0000UL
/* ETH.TX_PAUSE_QUANTUM2 */
#define ETH_TX_PAUSE_QUANTUM2_QUANTUM_P4_Pos    0UL
#define ETH_TX_PAUSE_QUANTUM2_QUANTUM_P4_Msk    0xFFFFUL
#define ETH_TX_PAUSE_QUANTUM2_QUANTUM_P5_Pos    16UL
#define ETH_TX_PAUSE_QUANTUM2_QUANTUM_P5_Msk    0xFFFF0000UL
/* ETH.TX_PAUSE_QUANTUM3 */
#define ETH_TX_PAUSE_QUANTUM3_QUANTUM_P6_Pos    0UL
#define ETH_TX_PAUSE_QUANTUM3_QUANTUM_P6_Msk    0xFFFFUL
#define ETH_TX_PAUSE_QUANTUM3_QUANTUM_P7_Pos    16UL
#define ETH_TX_PAUSE_QUANTUM3_QUANTUM_P7_Msk    0xFFFF0000UL
/* ETH.RX_LPI */
#define ETH_RX_LPI_COUNT_LPI_Pos                0UL
#define ETH_RX_LPI_COUNT_LPI_Msk                0xFFFFUL
/* ETH.RX_LPI_TIME */
#define ETH_RX_LPI_TIME_LPI_TIME_Pos            0UL
#define ETH_RX_LPI_TIME_LPI_TIME_Msk            0xFFFFFFUL
/* ETH.TX_LPI */
#define ETH_TX_LPI_COUNT_LPI_Pos                0UL
#define ETH_TX_LPI_COUNT_LPI_Msk                0xFFFFUL
/* ETH.TX_LPI_TIME */
#define ETH_TX_LPI_TIME_LPI_TIME_Pos            0UL
#define ETH_TX_LPI_TIME_LPI_TIME_Msk            0xFFFFFFUL
/* ETH.DESIGNCFG_DEBUG1 */
#define ETH_DESIGNCFG_DEBUG1_NO_PCS_Pos         0UL
#define ETH_DESIGNCFG_DEBUG1_NO_PCS_Msk         0x1UL
#define ETH_DESIGNCFG_DEBUG1_EXCLUDE_QBV_Pos    1UL
#define ETH_DESIGNCFG_DEBUG1_EXCLUDE_QBV_Msk    0x2UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_2_Pos     2UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_2_Msk     0xCUL
#define ETH_DESIGNCFG_DEBUG1_INT_LOOPBACK_Pos   4UL
#define ETH_DESIGNCFG_DEBUG1_INT_LOOPBACK_Msk   0x10UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_5_Pos     5UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_5_Msk     0x20UL
#define ETH_DESIGNCFG_DEBUG1_EXT_FIFO_INTERFACE_Pos 6UL
#define ETH_DESIGNCFG_DEBUG1_EXT_FIFO_INTERFACE_Msk 0x40UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_7_Pos     7UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_7_Msk     0x80UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_8_Pos     8UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_8_Msk     0x100UL
#define ETH_DESIGNCFG_DEBUG1_USER_IO_Pos        9UL
#define ETH_DESIGNCFG_DEBUG1_USER_IO_Msk        0x200UL
#define ETH_DESIGNCFG_DEBUG1_USER_OUT_WIDTH_Pos 10UL
#define ETH_DESIGNCFG_DEBUG1_USER_OUT_WIDTH_Msk 0x7C00UL
#define ETH_DESIGNCFG_DEBUG1_USER_IN_WIDTH_Pos  15UL
#define ETH_DESIGNCFG_DEBUG1_USER_IN_WIDTH_Msk  0xF8000UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_20_Pos    20UL
#define ETH_DESIGNCFG_DEBUG1_RESERVED_20_Msk    0x100000UL
#define ETH_DESIGNCFG_DEBUG1_NO_STATS_Pos       21UL
#define ETH_DESIGNCFG_DEBUG1_NO_STATS_Msk       0x200000UL
#define ETH_DESIGNCFG_DEBUG1_NO_SNAPSHOT_Pos    22UL
#define ETH_DESIGNCFG_DEBUG1_NO_SNAPSHOT_Msk    0x400000UL
#define ETH_DESIGNCFG_DEBUG1_IRQ_READ_CLEAR_Pos 23UL
#define ETH_DESIGNCFG_DEBUG1_IRQ_READ_CLEAR_Msk 0x800000UL
#define ETH_DESIGNCFG_DEBUG1_EXCLUDE_CBS_Pos    24UL
#define ETH_DESIGNCFG_DEBUG1_EXCLUDE_CBS_Msk    0x1000000UL
#define ETH_DESIGNCFG_DEBUG1_DMA_BUS_WIDTH_Pos  25UL
#define ETH_DESIGNCFG_DEBUG1_DMA_BUS_WIDTH_Msk  0xE000000UL
#define ETH_DESIGNCFG_DEBUG1_AXI_CACHE_VALUE_Pos 28UL
#define ETH_DESIGNCFG_DEBUG1_AXI_CACHE_VALUE_Msk 0xF0000000UL
/* ETH.DESIGNCFG_DEBUG2 */
#define ETH_DESIGNCFG_DEBUG2_JUMBO_MAX_LENGTH_Pos 0UL
#define ETH_DESIGNCFG_DEBUG2_JUMBO_MAX_LENGTH_Msk 0x3FFFUL
#define ETH_DESIGNCFG_DEBUG2_HPROT_VALUE_Pos    16UL
#define ETH_DESIGNCFG_DEBUG2_HPROT_VALUE_Msk    0xF0000UL
#define ETH_DESIGNCFG_DEBUG2_RX_PKT_BUFFER_Pos  20UL
#define ETH_DESIGNCFG_DEBUG2_RX_PKT_BUFFER_Msk  0x100000UL
#define ETH_DESIGNCFG_DEBUG2_TX_PKT_BUFFER_Pos  21UL
#define ETH_DESIGNCFG_DEBUG2_TX_PKT_BUFFER_Msk  0x200000UL
#define ETH_DESIGNCFG_DEBUG2_RX_PBUF_ADDR_Pos   22UL
#define ETH_DESIGNCFG_DEBUG2_RX_PBUF_ADDR_Msk   0x3C00000UL
#define ETH_DESIGNCFG_DEBUG2_TX_PBUF_ADDR_Pos   26UL
#define ETH_DESIGNCFG_DEBUG2_TX_PBUF_ADDR_Msk   0x3C000000UL
#define ETH_DESIGNCFG_DEBUG2_AXI_Pos            30UL
#define ETH_DESIGNCFG_DEBUG2_AXI_Msk            0x40000000UL
#define ETH_DESIGNCFG_DEBUG2_SPRAM_Pos          31UL
#define ETH_DESIGNCFG_DEBUG2_SPRAM_Msk          0x80000000UL
/* ETH.DESIGNCFG_DEBUG3 */
#define ETH_DESIGNCFG_DEBUG3_NUM_SPEC_ADD_FILTERS_Pos 24UL
#define ETH_DESIGNCFG_DEBUG3_NUM_SPEC_ADD_FILTERS_Msk 0x3F000000UL
/* ETH.DESIGNCFG_DEBUG4 */
#define ETH_DESIGNCFG_DEBUG4_RESERVED_31_0_Pos  0UL
#define ETH_DESIGNCFG_DEBUG4_RESERVED_31_0_Msk  0xFFFFFFFFUL
/* ETH.DESIGNCFG_DEBUG5 */
#define ETH_DESIGNCFG_DEBUG5_RX_FIFO_CNT_WIDTH_Pos 0UL
#define ETH_DESIGNCFG_DEBUG5_RX_FIFO_CNT_WIDTH_Msk 0xFUL
#define ETH_DESIGNCFG_DEBUG5_TX_FIFO_CNT_WIDTH_Pos 4UL
#define ETH_DESIGNCFG_DEBUG5_TX_FIFO_CNT_WIDTH_Msk 0xF0UL
#define ETH_DESIGNCFG_DEBUG5_TSU_Pos            8UL
#define ETH_DESIGNCFG_DEBUG5_TSU_Msk            0x100UL
#define ETH_DESIGNCFG_DEBUG5_PHY_IDENT_Pos      9UL
#define ETH_DESIGNCFG_DEBUG5_PHY_IDENT_Msk      0x200UL
#define ETH_DESIGNCFG_DEBUG5_DMA_BUS_WIDTH_DEF_Pos 10UL
#define ETH_DESIGNCFG_DEBUG5_DMA_BUS_WIDTH_DEF_Msk 0xC00UL
#define ETH_DESIGNCFG_DEBUG5_MDC_CLOCK_DIV_Pos  12UL
#define ETH_DESIGNCFG_DEBUG5_MDC_CLOCK_DIV_Msk  0x7000UL
#define ETH_DESIGNCFG_DEBUG5_ENDIAN_SWAP_DEF_Pos 15UL
#define ETH_DESIGNCFG_DEBUG5_ENDIAN_SWAP_DEF_Msk 0x18000UL
#define ETH_DESIGNCFG_DEBUG5_RX_PBUF_SIZE_DEF_Pos 17UL
#define ETH_DESIGNCFG_DEBUG5_RX_PBUF_SIZE_DEF_Msk 0x60000UL
#define ETH_DESIGNCFG_DEBUG5_TX_PBUF_SIZE_DEF_Pos 19UL
#define ETH_DESIGNCFG_DEBUG5_TX_PBUF_SIZE_DEF_Msk 0x80000UL
#define ETH_DESIGNCFG_DEBUG5_RX_BUFFER_LENGTH_DEF_Pos 20UL
#define ETH_DESIGNCFG_DEBUG5_RX_BUFFER_LENGTH_DEF_Msk 0xFF00000UL
#define ETH_DESIGNCFG_DEBUG5_TSU_CLK_Pos        28UL
#define ETH_DESIGNCFG_DEBUG5_TSU_CLK_Msk        0x10000000UL
#define ETH_DESIGNCFG_DEBUG5_AXI_PROT_VALUE_Pos 29UL
#define ETH_DESIGNCFG_DEBUG5_AXI_PROT_VALUE_Msk 0xE0000000UL
/* ETH.DESIGNCFG_DEBUG6 */
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE1_Pos 1UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE1_Msk 0x2UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE2_Pos 2UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE2_Msk 0x4UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE3_Pos 3UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE3_Msk 0x8UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE4_Pos 4UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE4_Msk 0x10UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE5_Pos 5UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE5_Msk 0x20UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE6_Pos 6UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE6_Msk 0x40UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE7_Pos 7UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE7_Msk 0x80UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE8_Pos 8UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE8_Msk 0x100UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE9_Pos 9UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE9_Msk 0x200UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE10_Pos 10UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE10_Msk 0x400UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE11_Pos 11UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE11_Msk 0x800UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE12_Pos 12UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE12_Msk 0x1000UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE13_Pos 13UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE13_Msk 0x2000UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE14_Pos 14UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE14_Msk 0x4000UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE15_Pos 15UL
#define ETH_DESIGNCFG_DEBUG6_DMA_PRIORITY_QUEUE15_Msk 0x8000UL
#define ETH_DESIGNCFG_DEBUG6_TX_PBUF_QUEUE_SEGMENT_SIZE_Pos 16UL
#define ETH_DESIGNCFG_DEBUG6_TX_PBUF_QUEUE_SEGMENT_SIZE_Msk 0xF0000UL
#define ETH_DESIGNCFG_DEBUG6_EXT_TSU_TIMER_Pos  20UL
#define ETH_DESIGNCFG_DEBUG6_EXT_TSU_TIMER_Msk  0x100000UL
#define ETH_DESIGNCFG_DEBUG6_TX_ADD_FIFO_IF_Pos 21UL
#define ETH_DESIGNCFG_DEBUG6_TX_ADD_FIFO_IF_Msk 0x200000UL
#define ETH_DESIGNCFG_DEBUG6_HOST_IF_SOFT_SELECT_Pos 22UL
#define ETH_DESIGNCFG_DEBUG6_HOST_IF_SOFT_SELECT_Msk 0x400000UL
#define ETH_DESIGNCFG_DEBUG6_DMA_ADDR_WIDTH_IS_64B_Pos 23UL
#define ETH_DESIGNCFG_DEBUG6_DMA_ADDR_WIDTH_IS_64B_Msk 0x800000UL
#define ETH_DESIGNCFG_DEBUG6_PFC_MULTI_QUANTUM_Pos 24UL
#define ETH_DESIGNCFG_DEBUG6_PFC_MULTI_QUANTUM_Msk 0x1000000UL
#define ETH_DESIGNCFG_DEBUG6_PBUF_CUTTHRU_Pos   25UL
#define ETH_DESIGNCFG_DEBUG6_PBUF_CUTTHRU_Msk   0x2000000UL
#define ETH_DESIGNCFG_DEBUG6_PBUF_RSC_Pos       26UL
#define ETH_DESIGNCFG_DEBUG6_PBUF_RSC_Msk       0x4000000UL
#define ETH_DESIGNCFG_DEBUG6_PBUF_LSO_Pos       27UL
#define ETH_DESIGNCFG_DEBUG6_PBUF_LSO_Msk       0x8000000UL
/* ETH.DESIGNCFG_DEBUG7 */
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q0_Pos 0UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q0_Msk 0xFUL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q1_Pos 4UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q1_Msk 0xF0UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q2_Pos 8UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q2_Msk 0xF00UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q3_Pos 12UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q3_Msk 0xF000UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q4_Pos 16UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q4_Msk 0xF0000UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q5_Pos 20UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q5_Msk 0xF00000UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q6_Pos 24UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q6_Msk 0xF000000UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q7_Pos 28UL
#define ETH_DESIGNCFG_DEBUG7_X_PBUF_NUM_SEGMENTS_Q7_Msk 0xF0000000UL
/* ETH.DESIGNCFG_DEBUG8 */
#define ETH_DESIGNCFG_DEBUG8_NUM_SCR2_COMPARE_REGS_Pos 0UL
#define ETH_DESIGNCFG_DEBUG8_NUM_SCR2_COMPARE_REGS_Msk 0xFFUL
#define ETH_DESIGNCFG_DEBUG8_NUM_SCR2_ETHTYPE_REGS_Pos 8UL
#define ETH_DESIGNCFG_DEBUG8_NUM_SCR2_ETHTYPE_REGS_Msk 0xFF00UL
#define ETH_DESIGNCFG_DEBUG8_NUM_TYPE2_SCREENERS_Pos 16UL
#define ETH_DESIGNCFG_DEBUG8_NUM_TYPE2_SCREENERS_Msk 0xFF0000UL
#define ETH_DESIGNCFG_DEBUG8_NUM_TYPE1_SCREENERS_Pos 24UL
#define ETH_DESIGNCFG_DEBUG8_NUM_TYPE1_SCREENERS_Msk 0xFF000000UL
/* ETH.DESIGNCFG_DEBUG9 */
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q8_Pos 0UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q8_Msk 0xFUL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q9_Pos 4UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q9_Msk 0xF0UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q10_Pos 8UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q10_Msk 0xF00UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q11_Pos 12UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q11_Msk 0xF000UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q12_Pos 16UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q12_Msk 0xF0000UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q13_Pos 20UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q13_Msk 0xF00000UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q14_Pos 24UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q14_Msk 0xF000000UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q15_Pos 28UL
#define ETH_DESIGNCFG_DEBUG9_TX_PBUF_NUM_SEGMENTS_Q15_Msk 0xF0000000UL
/* ETH.DESIGNCFG_DEBUG10 */
#define ETH_DESIGNCFG_DEBUG10_AXI_RX_DESCR_WR_BUFF_BITS_Pos 0UL
#define ETH_DESIGNCFG_DEBUG10_AXI_RX_DESCR_WR_BUFF_BITS_Msk 0xFUL
#define ETH_DESIGNCFG_DEBUG10_AXI_TX_DESCR_WR_BUFF_BITS_Pos 4UL
#define ETH_DESIGNCFG_DEBUG10_AXI_TX_DESCR_WR_BUFF_BITS_Msk 0xF0UL
#define ETH_DESIGNCFG_DEBUG10_AXI_RX_DESCR_RD_BUFF_BITS_Pos 8UL
#define ETH_DESIGNCFG_DEBUG10_AXI_RX_DESCR_RD_BUFF_BITS_Msk 0xF00UL
#define ETH_DESIGNCFG_DEBUG10_AXI_TX_DESCR_RD_BUFF_BITS_Pos 12UL
#define ETH_DESIGNCFG_DEBUG10_AXI_TX_DESCR_RD_BUFF_BITS_Msk 0xF000UL
#define ETH_DESIGNCFG_DEBUG10_AXI_ACCESS_PIPELINE_BITS_Pos 16UL
#define ETH_DESIGNCFG_DEBUG10_AXI_ACCESS_PIPELINE_BITS_Msk 0xF0000UL
#define ETH_DESIGNCFG_DEBUG10_RX_PBUF_DATA_Pos  20UL
#define ETH_DESIGNCFG_DEBUG10_RX_PBUF_DATA_Msk  0xF00000UL
#define ETH_DESIGNCFG_DEBUG10_TX_PBUF_DATA_Pos  24UL
#define ETH_DESIGNCFG_DEBUG10_TX_PBUF_DATA_Msk  0xF000000UL
#define ETH_DESIGNCFG_DEBUG10_EMAC_BUS_WIDTH_Pos 28UL
#define ETH_DESIGNCFG_DEBUG10_EMAC_BUS_WIDTH_Msk 0xF0000000UL
/* ETH.SPEC_ADD5_BOTTOM */
#define ETH_SPEC_ADD5_BOTTOM_RESERVED_31_0_Pos  0UL
#define ETH_SPEC_ADD5_BOTTOM_RESERVED_31_0_Msk  0xFFFFFFFFUL
/* ETH.SPEC_ADD5_TOP */
#define ETH_SPEC_ADD5_TOP_RESERVED_31_0_Pos     0UL
#define ETH_SPEC_ADD5_TOP_RESERVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.SPEC_ADD36_BOTTOM */
#define ETH_SPEC_ADD36_BOTTOM_RESERVED_31_0_Pos 0UL
#define ETH_SPEC_ADD36_BOTTOM_RESERVED_31_0_Msk 0xFFFFFFFFUL
/* ETH.SPEC_ADD36_TOP */
#define ETH_SPEC_ADD36_TOP_RESERVED_31_0_Pos    0UL
#define ETH_SPEC_ADD36_TOP_RESERVED_31_0_Msk    0xFFFFFFFFUL
/* ETH.INT_Q1_STATUS */
#define ETH_INT_Q1_STATUS_RECEIVE_COMPLETE_Pos  1UL
#define ETH_INT_Q1_STATUS_RECEIVE_COMPLETE_Msk  0x2UL
#define ETH_INT_Q1_STATUS_RX_USED_BIT_READ_Pos  2UL
#define ETH_INT_Q1_STATUS_RX_USED_BIT_READ_Msk  0x4UL
#define ETH_INT_Q1_STATUS_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_Pos 5UL
#define ETH_INT_Q1_STATUS_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_Msk 0x20UL
#define ETH_INT_Q1_STATUS_AMBA_ERROR_Pos        6UL
#define ETH_INT_Q1_STATUS_AMBA_ERROR_Msk        0x40UL
#define ETH_INT_Q1_STATUS_TRANSMIT_COMPLETE_Pos 7UL
#define ETH_INT_Q1_STATUS_TRANSMIT_COMPLETE_Msk 0x80UL
#define ETH_INT_Q1_STATUS_RESP_NOT_OK_Pos       11UL
#define ETH_INT_Q1_STATUS_RESP_NOT_OK_Msk       0x800UL
/* ETH.INT_Q2_STATUS */
#define ETH_INT_Q2_STATUS_RECEIVE_COMPLETE_Pos  1UL
#define ETH_INT_Q2_STATUS_RECEIVE_COMPLETE_Msk  0x2UL
#define ETH_INT_Q2_STATUS_RX_USED_BIT_READ_Pos  2UL
#define ETH_INT_Q2_STATUS_RX_USED_BIT_READ_Msk  0x4UL
#define ETH_INT_Q2_STATUS_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_Pos 5UL
#define ETH_INT_Q2_STATUS_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_Msk 0x20UL
#define ETH_INT_Q2_STATUS_AMBA_ERROR_Pos        6UL
#define ETH_INT_Q2_STATUS_AMBA_ERROR_Msk        0x40UL
#define ETH_INT_Q2_STATUS_TRANSMIT_COMPLETE_Pos 7UL
#define ETH_INT_Q2_STATUS_TRANSMIT_COMPLETE_Msk 0x80UL
#define ETH_INT_Q2_STATUS_RESP_NOT_OK_Pos       11UL
#define ETH_INT_Q2_STATUS_RESP_NOT_OK_Msk       0x800UL
/* ETH.INT_Q3_STATUS */
#define ETH_INT_Q3_STATUS_REMOVED_31_0_Pos      0UL
#define ETH_INT_Q3_STATUS_REMOVED_31_0_Msk      0xFFFFFFFFUL
/* ETH.INT_Q15_STATUS */
#define ETH_INT_Q15_STATUS_REMOVED_31_0_Pos     0UL
#define ETH_INT_Q15_STATUS_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.TRANSMIT_Q1_PTR */
#define ETH_TRANSMIT_Q1_PTR_DMA_TX_DIS_Q_Pos    0UL
#define ETH_TRANSMIT_Q1_PTR_DMA_TX_DIS_Q_Msk    0x1UL
#define ETH_TRANSMIT_Q1_PTR_DMA_TX_Q_PTR_Pos    2UL
#define ETH_TRANSMIT_Q1_PTR_DMA_TX_Q_PTR_Msk    0xFFFFFFFCUL
/* ETH.TRANSMIT_Q2_PTR */
#define ETH_TRANSMIT_Q2_PTR_DMA_TX_DIS_Q_Pos    0UL
#define ETH_TRANSMIT_Q2_PTR_DMA_TX_DIS_Q_Msk    0x1UL
#define ETH_TRANSMIT_Q2_PTR_DMA_TX_Q_PTR_Pos    2UL
#define ETH_TRANSMIT_Q2_PTR_DMA_TX_Q_PTR_Msk    0xFFFFFFFCUL
/* ETH.TRANSMIT_Q3_PTR */
#define ETH_TRANSMIT_Q3_PTR_REMOVED_31_0_Pos    0UL
#define ETH_TRANSMIT_Q3_PTR_REMOVED_31_0_Msk    0xFFFFFFFFUL
/* ETH.TRANSMIT_Q15_PTR */
#define ETH_TRANSMIT_Q15_PTR_REMOVED_31_0_Pos   0UL
#define ETH_TRANSMIT_Q15_PTR_REMOVED_31_0_Msk   0xFFFFFFFFUL
/* ETH.RECEIVE_Q1_PTR */
#define ETH_RECEIVE_Q1_PTR_DMA_RX_DIS_Q_Pos     0UL
#define ETH_RECEIVE_Q1_PTR_DMA_RX_DIS_Q_Msk     0x1UL
#define ETH_RECEIVE_Q1_PTR_DMA_RX_Q_PTR_Pos     2UL
#define ETH_RECEIVE_Q1_PTR_DMA_RX_Q_PTR_Msk     0xFFFFFFFCUL
/* ETH.RECEIVE_Q2_PTR */
#define ETH_RECEIVE_Q2_PTR_DMA_RX_DIS_Q_Pos     0UL
#define ETH_RECEIVE_Q2_PTR_DMA_RX_DIS_Q_Msk     0x1UL
#define ETH_RECEIVE_Q2_PTR_DMA_RX_Q_PTR_Pos     2UL
#define ETH_RECEIVE_Q2_PTR_DMA_RX_Q_PTR_Msk     0xFFFFFFFCUL
/* ETH.RECEIVE_Q3_PTR */
#define ETH_RECEIVE_Q3_PTR_REMOVED_31_0_Pos     0UL
#define ETH_RECEIVE_Q3_PTR_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.RECEIVE_Q7_PTR */
#define ETH_RECEIVE_Q7_PTR_REMOVED_31_0_Pos     0UL
#define ETH_RECEIVE_Q7_PTR_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.DMA_RXBUF_SIZE_Q1 */
#define ETH_DMA_RXBUF_SIZE_Q1_DMA_RX_Q_BUF_SIZE_Pos 0UL
#define ETH_DMA_RXBUF_SIZE_Q1_DMA_RX_Q_BUF_SIZE_Msk 0xFFUL
/* ETH.DMA_RXBUF_SIZE_Q2 */
#define ETH_DMA_RXBUF_SIZE_Q2_DMA_RX_Q_BUF_SIZE_Pos 0UL
#define ETH_DMA_RXBUF_SIZE_Q2_DMA_RX_Q_BUF_SIZE_Msk 0xFFUL
/* ETH.DMA_RXBUF_SIZE_Q3 */
#define ETH_DMA_RXBUF_SIZE_Q3_REMOVED_31_0_Pos  0UL
#define ETH_DMA_RXBUF_SIZE_Q3_REMOVED_31_0_Msk  0xFFFFFFFFUL
/* ETH.DMA_RXBUF_SIZE_Q7 */
#define ETH_DMA_RXBUF_SIZE_Q7_REMOVED_31_0_Pos  0UL
#define ETH_DMA_RXBUF_SIZE_Q7_REMOVED_31_0_Msk  0xFFFFFFFFUL
/* ETH.CBS_CONTROL */
#define ETH_CBS_CONTROL_CBS_ENABLE_QUEUE_A_Pos  0UL
#define ETH_CBS_CONTROL_CBS_ENABLE_QUEUE_A_Msk  0x1UL
#define ETH_CBS_CONTROL_CBS_ENABLE_QUEUE_B_Pos  1UL
#define ETH_CBS_CONTROL_CBS_ENABLE_QUEUE_B_Msk  0x2UL
/* ETH.CBS_IDLESLOPE_Q_A */
#define ETH_CBS_IDLESLOPE_Q_A_IDLESLOPE_A_Pos   0UL
#define ETH_CBS_IDLESLOPE_Q_A_IDLESLOPE_A_Msk   0xFFFFFFFFUL
/* ETH.CBS_IDLESLOPE_Q_B */
#define ETH_CBS_IDLESLOPE_Q_B_IDLESLOPE_B_Pos   0UL
#define ETH_CBS_IDLESLOPE_Q_B_IDLESLOPE_B_Msk   0xFFFFFFFFUL
/* ETH.UPPER_TX_Q_BASE_ADDR */
#define ETH_UPPER_TX_Q_BASE_ADDR_UPPER_TX_Q_BASE_ADDR_Pos 0UL
#define ETH_UPPER_TX_Q_BASE_ADDR_UPPER_TX_Q_BASE_ADDR_Msk 0xFFFFFFFFUL
/* ETH.TX_BD_CONTROL */
#define ETH_TX_BD_CONTROL_TX_BD_TS_MODE_Pos     4UL
#define ETH_TX_BD_CONTROL_TX_BD_TS_MODE_Msk     0x30UL
/* ETH.RX_BD_CONTROL */
#define ETH_RX_BD_CONTROL_RX_BD_TS_MODE_Pos     4UL
#define ETH_RX_BD_CONTROL_RX_BD_TS_MODE_Msk     0x30UL
/* ETH.UPPER_RX_Q_BASE_ADDR */
#define ETH_UPPER_RX_Q_BASE_ADDR_UPPER_RX_Q_BASE_ADDR_Pos 0UL
#define ETH_UPPER_RX_Q_BASE_ADDR_UPPER_RX_Q_BASE_ADDR_Msk 0xFFFFFFFFUL
/* ETH.HIDDEN_REG0 */
#define ETH_HIDDEN_REG0_HIDDEN0_FIELD_Pos       0UL
#define ETH_HIDDEN_REG0_HIDDEN0_FIELD_Msk       0xFFFFFFFFUL
/* ETH.HIDDEN_REG1 */
#define ETH_HIDDEN_REG1_HIDDEN1_FIELD_Pos       0UL
#define ETH_HIDDEN_REG1_HIDDEN1_FIELD_Msk       0xFFFFFFFFUL
/* ETH.HIDDEN_REG2 */
#define ETH_HIDDEN_REG2_HIDDEN2_FIELD_Pos       0UL
#define ETH_HIDDEN_REG2_HIDDEN2_FIELD_Msk       0xFFFFFFFFUL
/* ETH.HIDDEN_REG3 */
#define ETH_HIDDEN_REG3_HIDDEN3_FIELD_Pos       0UL
#define ETH_HIDDEN_REG3_HIDDEN3_FIELD_Msk       0xFUL
/* ETH.HIDDEN_REG4 */
#define ETH_HIDDEN_REG4_HIDDEN4_FIELD_L_Pos     0UL
#define ETH_HIDDEN_REG4_HIDDEN4_FIELD_L_Msk     0x1FFUL
#define ETH_HIDDEN_REG4_HIDDEN4_FIELD_H_Pos     16UL
#define ETH_HIDDEN_REG4_HIDDEN4_FIELD_H_Msk     0x1FF0000UL
/* ETH.HIDDEN_REG5 */
#define ETH_HIDDEN_REG5_HIDDEN5_FIELD_L_Pos     0UL
#define ETH_HIDDEN_REG5_HIDDEN5_FIELD_L_Msk     0x1FFUL
#define ETH_HIDDEN_REG5_HIDDEN5_FIELD_H_Pos     16UL
#define ETH_HIDDEN_REG5_HIDDEN5_FIELD_H_Msk     0x1FF0000UL
/* ETH.SCREENING_TYPE_1_REGISTER_0 */
#define ETH_SCREENING_TYPE_1_REGISTER_0_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_0_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_0_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_0_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_0_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_0_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_0_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_0_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_0_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_0_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_1 */
#define ETH_SCREENING_TYPE_1_REGISTER_1_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_1_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_1_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_1_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_1_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_1_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_1_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_1_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_1_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_1_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_2 */
#define ETH_SCREENING_TYPE_1_REGISTER_2_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_2_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_2_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_2_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_2_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_2_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_2_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_2_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_2_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_2_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_3 */
#define ETH_SCREENING_TYPE_1_REGISTER_3_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_3_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_3_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_3_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_3_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_3_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_3_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_3_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_3_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_3_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_4 */
#define ETH_SCREENING_TYPE_1_REGISTER_4_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_4_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_4_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_4_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_4_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_4_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_4_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_4_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_4_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_4_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_5 */
#define ETH_SCREENING_TYPE_1_REGISTER_5_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_5_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_5_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_5_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_5_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_5_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_5_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_5_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_5_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_5_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_6 */
#define ETH_SCREENING_TYPE_1_REGISTER_6_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_6_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_6_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_6_DSTC_MATCH_Msk 0xFF0UL
